IRP/src/Catalogs/ObjectStatuses/ObjectStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>ObjectStatuses</name>
 <hierarchical>true</hierarchical>
 <predefined>
  <items>
   <name>SalesOrder</name>
  </items>
  <items>
   <name>SalesReturnOrder</name>
  </items>
  <items>
   <name>PurchaseOrder</name>
  </items>
  <items>
   <name>PurchaseReturnOrder</name>
  </items>
  <items>
   <name>InventoryTransferOrder</name>
  </items>
  <items>
   <name>OutgoingPaymentOrder</name>
  </items>
  <items>
   <name>ReconciliationStatement</name>
  </items>
  <items>
   <name>PhysicalCountByLocation</name>
  </items>
  <items>
   <name>PhysicalInventory</name>
  </items>
  <items>
   <name>IncomingPaymentOrder</name>
  </items>
  <items>
   <name>ChequeBondTransaction</name>
  </items>
  <items>
   <name>WorkOrder</name>
  </items>
  <items>
   <name>ProductionPlanningCorrection</name>
  </items>
 </predefined>
 <attributes>
  <name>SetByDefault</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>Posting</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>PostingChequeBondBalance</name>
  <type>
   <types>EnumRef.DocumentPostingTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>PostingVendorTransactions</name>
  <type>
   <types>EnumRef.DocumentPostingTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>PostingCustomerTransactions</name>
  <type>
   <types>EnumRef.DocumentPostingTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>PostingCashPlanning</name>
  <type>
   <types>EnumRef.DocumentPostingTypes</types>
  </type>
 </attributes>
 <tabularSections>
  <name>NextPossibleStatuses</name>
  <attributes>
   <name>Status</name>
   <type>
    <types>CatalogRef.ObjectStatuses</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>Users</name>
  <attributes>
   <name>User</name>
   <type>
    <types>CatalogRef.Users</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/ObjectStatuses/ManagerModule.bsl
Procedure ChoiceDataGetProcessing(ChoiceData, Parameters, StandardProcessing)

	If TypeOf(Parameters) <> Type("Structure") Or Not Parameters.Filter.Property("AdditionalParameters") Then
		If Not Parameters.Filter.Count() Then
			StandardProcessing = False;
		EndIf;
		Return;
	EndIf;

	StandardProcessing = False;
	If Not ValueIsFilled(Parameters.SearchString) Then
		Return;
	EndIf;

	QueryTable = GetChoiceDataTable(Parameters);
	ChoiceData = New ValueList();
	For Each Row In QueryTable Do
		ChoiceData.Add(Row.Ref, Row.Presentation);
	EndDo;
EndProcedure

Function GetChoiceDataTable(Parameters) Export
	Filter = "
			 |	AND CASE
			 |		WHEN &Filter_RefInList
			 |			THEN Table.Ref IN (&RefList)
			 |		ELSE TRUE
			 |	END
			 |";

	Settings = New Structure();
	Settings.Insert("MetadataObject", Metadata.Catalogs.ObjectStatuses);
	Settings.Insert("Filter", Filter);

	QueryBuilderText = CommonFormActionsServer.QuerySearchInputByString(Settings);
	QueryBuilder = New QueryBuilder(QueryBuilderText);
	QueryBuilder.FillSettings();
	If TypeOf(Parameters) = Type("Structure") And Parameters.Filter.Property("CustomSearchFilter") Then
		ArrayOfFilters = CommonFunctionsServer.DeserializeXMLUseXDTO(Parameters.Filter.CustomSearchFilter);
		For Each Filter In ArrayOfFilters Do
			NewFilter = QueryBuilder.Filter.Add("Ref." + Filter.FieldName);
			NewFilter.Use = True;
			NewFilter.ComparisonType = CommonFunctionsClientServer.CompositionComparisonTypeToComparisonType(
				Filter.ComparisonType);
			NewFilter.Value = Filter.Value;
		EndDo;
	EndIf;
	Query = QueryBuilder.GetQuery();

	Query.SetParameter("SearchString", Parameters.SearchString);

	AdditionalParameters = CommonFunctionsServer.DeserializeXMLUseXDTO(Parameters.Filter.AdditionalParameters);
	QueryParameters = New Structure("Filter_RefInList, RefList", False, New Array());
	FillPropertyValues(QueryParameters, AdditionalParameters);
	For Each QueryParameter In QueryParameters Do
		Query.SetParameter(QueryParameter.Key, QueryParameter.Value);
	EndDo;
	Return Query.Execute().Unload();
EndFunction
